app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = Product.all.page(params[:page]).per(10)

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]
---
  def like
    @product = Product.find(params[:id])

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]
---
  def dislike
    @product = Product.find(params[:id])